Mehmetdora/STM32F411RE_BARE_METAL_C_PROGRAMMING/I2C_EXAMPLES_1/Drivers/Modules/I2C_Driver.c
/*
 * I2C_Driver.c
 *
 *  Created on: Apr 3, 2026
 *      Author: mehmet_dora
 */


#include "I2C_Driver.h"
#include "stm32f4xx.h"



void I2C1_init(void){

	// I2c kullanmak için GPIO pinleri AF olarak ayarlanmalıdır

	RCC->APB1ENR |= (1UL << 21);	// I2c1 enable clock
	RCC->AHB1ENR |= (1UL << 1);		// GPIOB clock enable



	GPIOB->MODER &= ~(3UL << (2*8));
	GPIOB->MODER |= (1UL << (2*8));

	GPIOB->MODER &= ~(3UL << (2*9));
	GPIOB->MODER |= (1UL << (2*9));


	GPIOB->OTYPER |= (1UL << 8);	// PB8-9 open drain
	GPIOB->OTYPER |= (1UL << 9);

	GPIOB->PUPDR |= (1UL << (2*8));	// PB8-9 pull-up
	GPIOB->PUPDR |= (1UL << (2*9));



	// I2C peripheral
	I2C1->CR1 |= (1UL << 15);	// reset state enable
	I2C1->CR1 &= ~(1UL << 15);	// reset state disable

	// 42 MHz için -> 101010
	I2C1->CR2 |= 42UL;

	// SCL in clock un high ve low sürelerinin belirlenmesi, duty-cycle ayarı
	// CCR = 42 MHz(APB1 freq.) / (2 * 100 kHz)
	I2C1->CCR = 210;



	/*
	 * I2C hattı opendrain ve pull-up olduğundan hemen low->high a geçemez,
	 * bu geçiş süresine TRise denir
	 * Bu süre ayarlanarak donanıma haber verilir.
	 */
	I2C1->TRISE = 43;


	I2C1->CR1 |= (1UL << 0);	// I2C1 Enable

}

/*
 * Bir cihazdan veri okunacağı zaman önce hangi adresinden verinin okunacağı write
 * modunda iken gönderiliyor, sonrasında eğer bu adresten veri okunacaksa write modundan
 * read moduna geçilmesi gerekiyor. Bu işlem stop ile de yapılabilir fakat o zaman
 * iletişim kopar ve hatta başka cihazlar girebilir, bunu önlemek ve modu iletişimi
 * durdurmadan değiştirmek için restart yapılır, bu sefer read modunda iletişim başlatılır
 * ve ilgili adresten veriler okunabilir. En sonda da stop ile bitirilir.
 *
 * Eğer bir adresten veri okumak yerine oraya yazılacaksa write modunda iletişim başlatılır
 * fakat restart yapmadan tekrar aynı modda yazılmaya devam edilebilir.
 */

void I2C1_ByteRead(char saddr, char maddr, char* data){
	/*
	saddr → Slave cihaz adresi (örneğin sensör: 0x68)
	maddr → Okunacak cihazın memory adresi (örneğin: 0x75)
	data → Okunan verinin yazılacağı pointer
	*/

	/*
	 * 1- SR2 den Busy bit kontrolü
	 * 2- CR1 start bit gönderme ve set edilmesini bekleme
	 * 3- Slave adresinin write modda gönderilmesi
	 * 4- Slave den ACK beklenmesi ve geldikten sonra ADDR flag clear edilmesi(SR2 den değer okunması)
	 * 5- Slave e okunacak register adresinin gönderilmesi ve TxE ile gönderildiğinin doğrulanması
	 * 6- restart yapılması, önce write ile adres gönderildi, bundan sonra read yapılacak
	 * 7- Slave adresinin read modda gönderilmesi ve doğrulanması
	 * 8- ACK disaable edilmesi, NACK gönderilerek iletişimin bitirilmesi
	 * 9- ADDR flag temizleme ve STOP bitinin gönderilmesi
	 * 10- Verinin gelmesini RXNE ile beklenmesi ve verinin alınması
	 */


	volatile int tmp;
	// bu değişken ile SR2 register okunarak ADDR flag temizlenmiş olunacak
	// volatile kullanılır çünkü compiler kodu optimize ederken bu değişkeni kaldırabilir




	while(I2C1->SR2 & (1UL << 1));
	// Eğer hat busy ise bekle, değilse veri okumaya başla
	// aynı anda 2 master çakışmasın diye







	// generate start
	I2C1->CR1 |= (1UL << 8);
	// Start condition oluşturulur, master biz ise bu start ı gönderebiliriz
	// Bus iletişimi başlar

	while(!(I2C1->SR1 & (1UL << 0)));
	// wait for enable start condition, wait for start bit flag







	// transmit slave adress + write
	I2C1->DR |= (saddr << 1);
	// Slave adresi gönderiliyor, write modunda olması gerektiği için de lsb 0 olmalı
	//LSB = 0 → WRITE mode
	// 0. bit write-read modunu belirliyor

	// wait for addr flag set
	while(!(I2C1->SR1 & (1UL << 1)));
	// adres gönderildi mi diye beklenir
	// flag oluşması ile slave cihaz adresi almış olur ve ACK göndermiş olur

	// flag clear
	tmp = I2C1->SR2;
	// ADDR flag temizlemek için SR2 değerinin okunması gerekir









	// send memory address
	I2C1->DR = maddr;
	// Slave cihaza hangi adresi okumak istediğini gönder

	// wait until trasmitter empty
	while(!(I2C1->SR1 & (1UL << 7)));	// TxE
	// Verinin gönderildiğini ve DR ın boşaldığını bekle








	// generate restart, this time for reading data
	I2C1->CR1 |= (1UL << 8);

	// wait for start generation
	while(!(I2C1->SR1 & (1UL << 0)));






	// transmit slave address + read
	I2C1->DR = (saddr << 1) | 1 ;
	// Verinin okunacağı slave cihaz adresi gönderilir
	// Veri okuması yapılacağı için lsb -> 1 yapılarak read modu seçilir

	// wait until addr flag is set
	while(!(I2C1->SR1 & (1UL << 1)));
	// Slave cihaz read adresini aldı ve ACK gönderdiğin bekle

	// disable ACK
	I2C1->CR1 &= ~(1UL << 10);
	// Tek bir byte okunacağından ACK gönderilmez
	// bu nedenle slave NACK alır ve iletişimi durdurur






	// clear addr flag
	tmp = I2C1->SR2;
	// ADDR flag temizlenir


	// Generate stop after data received
	I2C1->CR1 |= (1UL << 9);
	// veri alındıktan sonra hat serbest bırakılır

	// wait until RXNE flag is set
	while(!(I2C1->SR1 & (1UL << 6)));
	// DR a veri geldiğinde flag set olur


	// read data
	*data++ = I2C1->DR;


}



void I2C1_BurstRead(char saddr, char maddr, int n, char* data){

	/*
	 * Bu fonksiyon ile veriler okunurken bir kerelik bir adresten okunması yerine
	 * bir adresten başlanarak cihaz üzerindeki birden fazla adresten tek seferde
	 * verinin alınmasını sağlar, bir kerelik okuma.
	 *
	 * Yani aslında çoğu sensör veya cihaz auto-increment ile bir memory adresinden
	 * ACK ile veri okunduğunda kendisi bu adresi artttırır ki sonraki okumada
	 * başka bir register(memory) değeri okunsun. Bu fonksiyonda da maddr
	 * adresinden okunmaya başlanarak n kadar sonraki adrese kadar arka arkaya veriler
	 * alınır.
	 *
	 * Fakat her cihaz bu auto-increment özelliğini desteklemez , bu kontrol edilmelidir.
	 *
	 */

	volatile int tmp;

	while(I2C1->SR2 & (1UL << 1));
	// Eğer hat busy ise bekle, değilse veri okumaya başla
	// aynı anda 2 master çakışmasın diye







	// generate start
	I2C1->CR1 |= (1UL << 8);
	// Start condition oluşturulur, master biz ise bu start ı gönderebiliriz
	// Bus iletişimi başlar
	while(!(I2C1->SR1 & (1UL << 0)));
	// wait for enable start condition, wait for start bit flag





	// transmit slave adress + write
	I2C1->DR |= (saddr << 1);
	// Slave adresi gönderiliyor, write modunda olması gerektiği için de lsb 0 olmalı
	//LSB = 0 → WRITE mode
	// 0. bit write-read modunu belirliyor

	// wait for addr flag set
	while(!(I2C1->SR1 & (1UL << 1)));
	// adres gönderildi mi diye beklenir
	// flag oluşması ile slave cihaz adresi almış olur ve ACK göndermiş olur

	// flag clear
	tmp = I2C1->SR2;
	// ADDR flag temizlemek için SR2 değerinin okunması gerekir





	// wait until trasmitter empty
	while(!(I2C1->SR1 & (1UL << 7)));	// TxE
	// Verinin gönderildiğini ve DR ın boşaldığını bekle

	// send memory address
	I2C1->DR = maddr;
	// Slave cihaza hangi adresi okumak istediğini gönder

	// wait until trasmitter empty
	while(!(I2C1->SR1 & (1UL << 7)));	// TxE
	// Verinin gönderildiğini ve DR ın boşaldığını bekle




	// generate restart, this time for reading data
	I2C1->CR1 |= (1UL << 8);

	// wait for start generation
	while(!(I2C1->SR1 & (1UL << 0)));




	// transmit slave address + read
	I2C1->DR = (saddr << 1) | 1 ;
	// Verinin okunacağı slave cihaz adresi gönderilir
	// Veri okuması yapılacağı için lsb -> 1 yapılarak read modu seçilir

	// wait until addr flag is set
	while(!(I2C1->SR1 & (1UL << 1)));
	// Slave cihaz read adresini aldı ve ACK gönderdiğin bekle

	// flag clear
	tmp = I2C1->SR2;

	// enable ACK
	I2C1->CR1 |= (1UL << 10);




	while(n > 0U){


		if(n == 1U){
			// disable ACK
			I2C1->CR1 &= ~(1UL << 10);
			// Tek bir byte okunacağından ACK gönderilmez
			// bu nedenle slave NACK alır ve iletişimi durdurur

			// Generate stop after data received
			I2C1->CR1 |= (1UL << 9);
			// veri alındıktan sonra hat serbest bırakılır

			// wait until RXNE flag is set
			while(!(I2C1->SR1 & (1UL << 6)));
			// DR a veri geldiğinde flag set olur


			// read data
			*data++ = I2C1->DR;

			break;

		}else{

			// wait until RXNE flag is set
			while(!(I2C1->SR1 & (1UL << 6)));
			// DR a veri geldiğinde flag set olur


			// read data
			*data++ = I2C1->DR;

			n--;

		}



	}
}






/*
 * Bu write fonksiyonunda ise write modunda adres gönderilir, sonrasında peş peşe
 * adreslere yazılmak istenen veriler gönderilir. yani tek bir transaction için
 * birden fazla veri gönderilir. Bunu yapmak için biz burada for ile her veri gittiğinde
 * sonraki veriyi pointer ile gösteriyoruz , slave cihaz ise kendi özelliği olan
 * auto-increment ile eğer birden fazla(2. bir veri) gelmiş ise kendisi bu sonraki
 * verinin geleceği adresi gösteriyor.
 *
 * bu sayede tek seferde blok veri gönderilmiş olunuyor. En son BTF ile tüm verinin
 * gönderildiği teyit ediliyor ve iletişim bitiriliyor.
 */
void I2C1_BurstWrite(char saddr, char maddr, int n, char* data){

	// Bir slave cihaza belirtilen adresten başlayarak n byte veri yazar.
	// Bir ekrana yada bir sensöre config verilerini göndermek için kullanılabilir.

	volatile int tmp;

	while(I2C1->SR2 & (1UL << 1));
	// Eğer hat busy ise bekle, değilse veri okumaya başla
	// aynı anda 2 master çakışmasın diye







	// generate start
	I2C1->CR1 |= (1UL << 8);
	// Start condition oluşturulur, master biz ise bu start ı gönderebiliriz
	// Bus iletişimi başlar
	while(!(I2C1->SR1 & (1UL << 0)));
	// wait for enable start condition, wait for start bit flag





	// transmit slave adress + write
	I2C1->DR |= (saddr << 1);
	// Slave adresi gönderiliyor, write modunda olması gerektiği için de lsb 0 olmalı
	//LSB = 0 → WRITE mode
	// 0. bit write-read modunu belirliyor

	// wait for addr flag set
	while(!(I2C1->SR1 & (1UL << 1)));
	// adres gönderildi mi diye beklenir
	// flag oluşması ile slave cihaz adresi almış olur ve ACK göndermiş olur

	// flag clear
	tmp = I2C1->SR2;
	// ADDR flag temizlemek için SR2 değerinin okunması gerekir





	// wait until trasmitter empty
	while(!(I2C1->SR1 & (1UL << 7)));	// TxE
	// Verinin gönderildiğini ve DR ın boşaldığını bekle

	// send memory address
	I2C1->DR = maddr;
	// Slave cihaza hangi adresi okumak istediğini gönder




	for(int i = 0; i<n; i++){
		// wait until trasmitter empty
		while(!(I2C1->SR1 & (1UL << 7)));	// TxE
		// Verinin gönderildiğini ve DR ın boşaldığını bekle

		// read data
		I2C1->DR = *data++;



	}


	// wait until transfer finished
	while(!(I2C1->SR1 & (1UL << 2)));
	// RXNE yerine BTF(byte transfer finished) ile kontrol edilir


	// Generate stop after data received
	I2C1->CR1 |= (1UL << 9);
	// veri alındıktan sonra hat serbest bırakılır
}





